# SchemaGUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Entity..::..SchemaGUID Property
Entity Class See Also
---
The GUID of the Schema describing this Entity.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Guid SchemaGUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SchemaGUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid SchemaGUID {
	Guid get ();
}
```

# See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace